<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<%@ page trimDirectiveWhitespaces="true"%>
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<%@ include file="head.jsp"%>
<base href="<%=currentPath%>" />
<title>DM SUPER CLUB</title>
<%-- 配置信息开始 --%>
<meta name="pageId" content="log" />
<meta name="groupId" content="log" />
<meta name="bodyStyle" content="" />
<%-- 配置信息结束 --%>
</head>
<body>
	<div class="col-sm-12">
		<h1 style="margin-top: 20px; font-size: 1.2em;">更新日志：</h1>
		<div>8.05.5.1，增加手动选择赛事开奖处理；</div>
		<div>8.05.5.2，增加用户所有上级信息；</div>
		<div>8.05.5.3，增加后台提现导出功能；</div>
		<div>8.05.5.4，增加后台提现批量审核功能；</div>
		<div>8.05.4.1，增加管理员登录IP限制功能，只有白名单的IP可登录；</div>
		<div>8.05.4.2，修复用户级别计算；</div>
		<div>8.05.4.3，更新体验彩金下注规则，过期的彩金不提供下注功能；</div>
		<div>8.05.4.4，每日、每月统计增加更多统计；</div>
		<div>8.05.3.1，修复每日检查用户级别，每天3点开始检查；</div>
		<div>8.05.3.2，赛事统计增加全场、半场、公司利润等；</div>
		<div>8.05.2.1，支持未开奖的赛事撤回下注；</div>
		<div>8.05.2.2，会员转账需要短信验证码；</div>
		<div>8.05.2.3，赛事增加优先级，优先级高的优先显示,优先级大于100的将显示为推荐；</div>
		<div>8.05.2.4，检查团队奖功能移到用户下注管理页面；</div>
		<div>8.05.2.5，用户首页增加用户充值、提现、中奖等滚动信息；</div>
		<div>8.05.2.6，增加设置用户为系统用户接口，系统用户不参与每日和每月的数据统计，也不能提现和转账；</div>
		<div>8.04.27.1，后台增加统计数据；</div>
		<div>8.04.27.2，统计数据增加充值和提现；</div>
		<div>8.04.24.1，增加用户级别条件和自动检查；</div>
		<div>8.04.23.1，领导奖更加灵活设置级别和奖金；</div>
		<div>8.04.23.2，后台增加每日/每月数据统计；</div>
		<div>8.04.23.3，后台导入赛事文件判断 ；</div>
		<div>8.04.23.4，定时每天1:30统计赛事的信息 ；</div>
		<div>8.04.23.5，客户端增加团队和领袖奖金明细 ；</div>
		<div>8.04.22.1，增加领导奖配置管理；</div>
		<div>8.04.22.2，更改所有金额类型从int到long；</div>
		<div>8.04.19.1，计算团队业绩奖；</div>
		<div>8.04.18.1，前台页面增加排序和搜索；</div>
		<div>8.04.18.2，前台页面增加用户二维码；</div>
		<div>8.04.18.3，代理佣金和福利奖类别增加平级奖；</div>
		<div>8.04.18.4，汇总每场比赛的代理奖金和福利奖，并于周2和周4发放；</div>
		<div>8.04.18.5，后台增加每场比赛的各种奖金计算；</div>
		<div>8.04.14.1，用户下注信息记录更多信息；</div>
		<div>8.04.14.2，后台可任意设置用户级别；</div>
		<div>8.04.14.3，用户团队树信息显示；</div>
		<div>8.04.13.1，计算团队奖；</div>
		<div>8.04.13.2，导入比赛结果同时增加比赛；</div>
		<div>8.04.13.3，模板波胆可单独更新到未开始的比赛；</div>
		<div>8.04.12.1，导入比赛数据；</div>
		<div>8.04.12.2，增加波胆模板，可根据模板生成投注波胆；</div>
		<div>8.04.12.3，完善民乐支付，测试期间可充值0.01元(支付宝扫码支付测试可用,微信支付需要整数元才可支付)；</div>
		<div>8.04.11.1，注册体验金增加有效期；</div>
		<div>8.04.11.2，下注可用体验金；</div>
		<div>8.04.11.3，增加用户奖金模块；</div>
		<div>8.04.11.4，计算用户中奖奖金；</div>
		<div>8.04.11.5，充值、提现统一用人民币结算；</div>
		<div>8.04.11.6，添加民乐支付；</div>
		<div>8.04.09.1，增加足球投注模块；</div>
		<div>8.04.09.2，增加网页分页功能；</div>
		<div>8.04.09.3，修复一些问题；</div>
		<div>8.04.08.1，增加平台收款信息；</div>
		<div>8.04.08.2，增加用户充值功能；</div>
		<div>8.04.08.3，增加用户之间转账功能；</div>
		<div>8.04.08.4，增加用户团队管理；</div>
		<div>8.04.08.5，增加二级密码验证；</div>
		<div>8.04.07.1，完成用户提现；</div>
		<div>8.04.05.1，完善帮助中心；</div>
		<div>8.04.04.1，完善用户登录、重置密码、首页；</div>
		<div>8.04.04.2，完成会员模块；</div>
		<div>8.04.03.1，添加用户页面；</div>
		<div>8.04.02.1，添加球队信息；</div>
		<div>8.04.02.2，添加比赛信息；</div>
		<div>8.03.30.1，初始化；</div>
	</div>
</body>
</html>